alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
    if(OF_Prefs::InitFS() == OF_Prefs::Error_Success) {
        //OF_Prefs::ResetPreferences(); // ============ Format the file system / FORMATTA IL FILE SYSTEM =================================
        OF_Prefs::LoadProfiles();
    
        // Profile sanity checks
        // resets offsets that are wayyyyy too unreasonably high
        for(int i = 0; i < PROFILE_COUNT; ++i) {
            if(OF_Prefs::profiles[i].topOffset >= 32768     || OF_Prefs::profiles[i].topOffset <= -32768 ||
               OF_Prefs::profiles[i].bottomOffset >= 32768  || OF_Prefs::profiles[i].bottomOffset <= -32768 ||
               OF_Prefs::profiles[i].rightOffset >= 32768   || OF_Prefs::profiles[i].rightOffset <= -32768 ||
               OF_Prefs::profiles[i].leftOffset >= 32768    || OF_Prefs::profiles[i].leftOffset <= -32768) {
                OF_Prefs::profiles[i].topOffset = 0;
                OF_Prefs::profiles[i].bottomOffset = 0;
                OF_Prefs::profiles[i].leftOffset = 0;
                OF_Prefs::profiles[i].rightOffset = 0;
            }
        
            if(OF_Prefs::profiles[i].irSens > DFRobotIRPositionEx::Sensitivity_Max)
                OF_Prefs::profiles[i].irSens = DFRobotIRPositionEx::Sensitivity_Default;

            if(OF_Prefs::profiles[i].runMode >= FW_Const::RunMode_Count)
                OF_Prefs::profiles[i].runMode = FW_Const::RunMode_Normal;
        }

        // if selected profile is out of range, fallback to a default instead.
        if(OF_Prefs::currentProfile >= PROFILE_COUNT)
            OF_Prefs::currentProfile = 0;

        // set the run mode
        if(OF_Prefs::profiles[OF_Prefs::currentProfile].runMode < FW_Const::RunMode_Count)
            FW_Common::runMode = (FW_Const::RunMode_e)OF_Prefs::profiles[OF_Prefs::currentProfile].runMode;

        OF_Prefs::Load();
        
        #if defined(OPENFIRE_WIRELESS_ENABLE) && defined(ARDUINO_ARCH_ESP32)
            
            if (OF_Prefs::LoadLastDongleWireless(lastDongleAddress, &lastDongleChannel) == OF_Prefs::Error_Success) lastDongleSave = true;
                else lastDongleSave = false;
            
            if (OF_Prefs::LoadLastPedalWireless(lastPedalAddress, &lastPedalChannel) == OF_Prefs::Error_Success) lastPedalSave = true;
                else lastPedalSave = false;

        #endif // defined(OPENFIRE_WIRELESS_ENABLE) && defined(ARDUINO_ARCH_ESP32)
        
    } else Serial.printf("%c%c (No Storage Available)", OF_Const::sError, (char)OF_Prefs::Error_NoStorage);
    
    

// ===================================================================================
// DYNAMIC USB IDENTITY (SPOOFING/SHADOWING) / IDENTITA' DINAMICA USB (SPOOFING SHADOWING)
// ===================================================================================
// We prepare the peripheral's identity. If in Wireless mode, this data
// will be sent to the Dongle so it can impersonate this specific gun.
// If using a cable, we will configure our local TinyUSB with these same parameters.
// /
// Prepariamo l'identità della periferica. Se siamo in modalità Wireless, questi 
// dati verranno inviati al Dongle affinché possa fingersi questa specifica pistola. 
// Se siamo via Cavo, configureremo il nostro TinyUSB locale con questi stessi parametri.

    // ===== [ESP32_PORT] transmit data wirelessly to the dongle / per trasmettere i dati wireless al dongle ========
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
        strncpy(usb_data_wireless.deviceManufacturer,MANUFACTURER_NAME,sizeof(usb_data_wireless.deviceManufacturer));
        strncpy(usb_data_wireless.deviceName,DEVICE_NAME, sizeof(usb_data_wireless.deviceName)); // change / cambia
        usb_data_wireless.deviceVID = DEVICE_VID;
        #ifdef PLAYER_NUMBER
            usb_data_wireless.devicePID = PLAYER_NUMBER; // change / cambia
            usb_data_wireless.devicePlayer = PLAYER_NUMBER;
        #else
            usb_data_wireless.devicePID = 1; //PLAYER 1 DEFAULT
            usb_data_wireless.devicePlayer = 1; // PLAYER 1 DEFAULT
        #endif // PLAYER_NUMBER
        usb_data_wireless.channel = espnow_wifi_channel;
    #endif // defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
    // ===============================================================

 
    // We're setting our custom USB identifiers, as defined in the configuration area!
    #ifdef USE_TINYUSB
        // Initializes TinyUSB identifier
        if (!TinyUSBDevice.isInitialized()) { // [ESP32_PORT] Added... it worked anyway, but this way is safer... it's definitely needed for the ESP32 when using a library that isn't integrated into the core. / aggiunto ..funzionava lo stesso, ma così è più sicuro .. sicuramente serve per Esp32 con libreria non integrfata nel core
            TinyUSBDevice.begin(0);
        }
        // Values are pulled from EEPROM values that were loaded earlier in setup()
        TinyUSBDevice.setManufacturerDescriptor(MANUFACTURER_NAME);

        if(OF_Prefs::usb.devicePID) {
            TinyUSBDevice.setID(DEVICE_VID, OF_Prefs::usb.devicePID);
            #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
                usb_data_wireless.devicePID = OF_Prefs::usb.devicePID;
                usb_data_wireless.devicePlayer = OF_Prefs::usb.devicePID;
            #endif // defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)    
            if(OF_Prefs::usb.deviceName[0] == '\0')
                 TinyUSBDevice.setProductDescriptor(DEVICE_NAME);
            else {
                TinyUSBDevice.setProductDescriptor(OF_Prefs::usb.deviceName);
                #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
                    strncpy(usb_data_wireless.deviceName, OF_Prefs::usb.deviceName, sizeof(usb_data_wireless.deviceName));
                #endif // defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)    
            }
        } else {
            TinyUSBDevice.setProductDescriptor(DEVICE_NAME);
            TinyUSBDevice.setID(DEVICE_VID,
            #ifdef PLAYER_NUMBER
            PLAYER_NUMBER
            #else
            1
            #endif // PLAYER_NUMBER
            );
        }
        
        #if defined(ARDUINO_ARCH_ESP32)
        {
            // Adds the USB port description's serial number so that the same COM port is always mapped for each lightgun.
            // Formats the byte array into a hexadecimal string.
            // /
            // Aggiunge il serial number della descrizione della porta USB in modo che venga mappata sempre la stessa COM per ogni lightgun
            // Formatta l'array di byte in una stringa esadecimale.
            uint8_t mac_esp_interface[6];
            esp_err_t err_mac = esp_read_mac(mac_esp_interface, ESP_MAC_WIFI_STA);
            if (err_mac == ESP_OK) {
                static char serialNumber[13]; 
                snprintf(serialNumber, sizeof(serialNumber), "%02X%02X%02X%02X%02X%02X", MAC2STR(mac_esp_interface));
                TinyUSBDevice.setSerialDescriptor(serialNumber);
            }
        }
        #endif // ARDUINO_ARCH_ESP32

