alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
    }

    #endif
    // ===================================================================================
    // [ESP32_PORT] == FINE CODICE CALIBRAZIONE STICK ========================================
    // ===================================================================================

// ===================================================================================================================

// ===================================================================================
// CONNECTION ROUTING: WIRED (USB) VS WIRELESS (ESP-NOW)
// ===================================================================================
// Upon boot, the system waits ~1000ms to determine if it is connected to a PC via cable.
// If the USB host mounts the device, the Lightgun selects the physical serial port.
// Otherwise, it interprets the absence of a host as "Battery Mode,"
// disabling the local USB driver and activating the ESP-NOW radio to connect to the dongle.
// /
// Al boot, il sistema attende ~1000ms per capire se è connesso via Cavo a un PC.
// Se l'Host USB monta il dispositivo, la Lightgun sceglierà la porta Seriale fisica. 
// In caso contrario, interpreterà l'assenza di host come "Modalità Batteria", 
// disattivando il driver USB locale e accendendo la radio ESP-NOW per agganciarsi al Dongle.

#ifdef USE_TINYUSB
    #if defined(ARDUINO_RASPBERRY_PI_PICO_W) && defined(ENABLE_CLASSIC)
        // is VBUS (USB voltage) detected?
        if(digitalRead(34) || true) { // [ESP32_PORT] digitalRead(34) doesn't work well and in my opinion it's not a correct method. / digitalRead(34) non funziona bene ed a mio parere non è un metodo corretto
            // If so, we're connected via USB, so initializing the USB devices chunk.
            TinyUSBDevices.begin(POLL_RATE); // [ESP32_PORT] inserted this in place of the one below. / inserito questo al posto di quello sotto
            // TUSBDeviceSetup.begin(1); // [ESP32_PORT] removed, not yet complete transition. / tolto ancora non fatta completa transizione
            // wait until device mounted
            while(!USBDevice.mounted()) { yield(); }
            Serial.begin(9600);
            Serial.setTimeout(0);
            Serial_OpenFIRE_Stream = &Serial; // [ESP32_PORT] added by Alessandro / inserito da me
        } else {
            // Else, we're on batt, so init the Bluetooth chunks.
            if(OF_Prefs::usb.deviceName[0] == '\0')
                TinyUSBDevices.beginBT(DEVICE_NAME, DEVICE_NAME);
            else TinyUSBDevices.beginBT(OF_Prefs::usb.deviceName, OF_Prefs::usb.deviceName);
        }   
    #elif defined(ARDUINO_ARCH_RP2040) // [ESP32_PORT] inserted to maintain legacy code / inserito per mantenere vecchio codice
        // Initializing the USB devices chunk.
        TinyUSBDevices.begin(POLL_RATE);
        // wait until device mounted
        while(!USBDevice.mounted()) { yield(); }
        Serial.begin(9600);   // 9600 = 1ms data transfer rates, default for MAMEHOOKER COM devices.
        Serial.setTimeout(0);
        Serial_OpenFIRE_Stream = &Serial; // [ESP32_PORT] added by Alessandro / inserito da me
    #else // [ESP32_PORT] added by Alessandro / inserito da me // ARDUINO_ARCH_ESP32
    
    //////////////////////////////////////////////////////////////////////////////////////////////////////////
    // === [ESP32_PORT] === New USB initialization or wireless connection management / NUOVA GESTIONE INIZIALIZZAIZONE USB O CONNESSIONE WIRELESS ==================== //
    //////////////////////////////////////////////////////////////////////////////////////////////////////////

    TinyUSBDevices.begin(POLL_RATE);
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)   // IF WIRELESS / SE WIRELESS
        #define MILLIS_TIMEOUT  1000 //1 second / 1 secondi
        unsigned long lastMillis = millis ();
        while ((millis () - lastMillis <= MILLIS_TIMEOUT) && (!TinyUSBDevice.mounted())) { yield(); }
        if (!TinyUSBDevice.mounted()) {
            SerialWireless.init_wireless();
            SerialWireless.begin();
            if (lastDongleSave) {
                // Try connecting to the previous dongle by sending the CHECK_CONNECTION packet. / PROVA A CONNETTERTI AL PRECEDENTE DONGLE INVIANDO IL PACCHETTO CHECK_CONNECTION
                if (SerialWireless.connection_gun_at_last_dongle()) {
                } else {
                    SerialWireless.connection_gun();
                }
            }
            else {
                SerialWireless.connection_gun();
            }
        }
    #endif // OPENFIRE_WIRELESS_ENABLE

    while(!TinyUSBDevice.mounted() && !TinyUSBDevices.onBattery) { yield();}


    // Execution reaches this point only if the USB has been connected or a wireless connection has been negotiated and established. / arriva qui solo se e' stato connesso l'usb o e' stata negoziata e stabilita una connessione wireless
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
        #ifdef USES_DISPLAY
            FW_Common::OLED.TopPanelUpdate("  !! LINK READY !! "); 
            vTaskDelay(pdMS_TO_TICKS(1000));
        #endif //USES_DISPLAY
    #endif // defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)

    if (TinyUSBDevice.mounted()) {
        Serial.begin(9600);
        Serial.setTimeout(0);
        #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
            if (TinyUSBDevices.onBattery) {  // in the unlikely event that the USB is mounted at the exact moment the wireless connection is established / nel caso incredibile che l'USB sia montato nel momnto esatto in cui è stata stabilita connessione wireless
                TinyUSBDevices.onBattery = false;
            }
            if (TinyUSBDevices.wireless_mode != WIRELESS_MODE::NONE_WIRELESS) SerialWireless.end();
        #endif 
        Serial_OpenFIRE_Stream = & Serial;

    }  
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
    else {     
        if (!lastDongleSave || 
            (lastDongleSave && (!(memcmp(lastDongleAddress, peerAddress,6) == 0) || !(lastDongleChannel == espnow_wifi_channel)))) OF_Prefs::SaveLastDongleWireless(peerAddress, &espnow_wifi_channel);
        
        // Close any USB-related items if they need to be closed
        // Preserves memory and prevents USB core errors when not physically connected.
        // /
        // CHIUDI TUTTO CIO' CHE E' USB SE E' DA CHIUDERE
        // Salvaguarda la memoria e previene errori del core USB quando non è connesso fisicamente.
        TinyUSBDevice.clearConfiguration();
        TinyUSBDevice.detach();
        
        Serial_OpenFIRE_Stream = &SerialWireless;

        // ===== WIRELESS PEDAL MANAGEMENT / GESTIONE DEL PEDALE WIRELESS =====
        if((OF_Prefs::pins[OF_Const::btnPedal] == -1) && (OF_Prefs::pins[OF_Const::btnPedal2] == -1)) {
            if (lastPedalSave && (lastPedalChannel == espnow_wifi_channel)) {
                if (!SerialWireless.connection_gun_at_last_pedal()) SerialWireless.connection_gun_at_pedal();
            } else SerialWireless.connection_gun_at_pedal();
        }
        else {
            // sends a signal to the dongle indicating that the PEDAL procedure is complete / invia segnale al dongle che la procedura del PEDAL è completa
              SerialWireless.tx_gun_at_dongle_pedal_ready();
        }
        
        // Saves the last connected pedal. / salva l'ultimo pedale connesso
        if (TinyUSBDevices.is_pedal_wireless && (!lastPedalSave || 
            (lastPedalSave && (!(memcmp(lastPedalAddress, peerAddress_pedal,6) == 0) || !(lastPedalChannel == espnow_wifi_channel))))) OF_Prefs::SaveLastPedalWireless(peerAddress_pedal, &espnow_wifi_channel);
  
        // ===== END WIRELESS PEDAL MANAGEMENT / FINE GESTIONE DEL PEDALE =====

