alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
    }
    #endif

    // ===================================================================================
    // === [ESP32_PORT] === END USB initialization or wireless connection setup / FINE NUOVA GESTIONE INIZIALIZZAIZONE USB O CONNESSIONE WIRELESS
    // ===================================================================================
    #endif
#endif //USE_TINYUSB

    // Restores the top part of the display to its original state. / ripristina la parte superiore del diplay come in originale
    #ifdef ARDUINO_ARCH_ESP32
    #ifdef USES_DISPLAY
        FW_Common::OLED.ScreenModeChange(ExtDisplay::ScreenMode_e::Screen_None);
    #endif // USES_DISPLAY
    #endif //ARDUINO_ARCH_ESP32

// ===================================================================================
// POLYMORPHIC I/O: THE VIRTUAL SERIAL PORT TRICK / IL TRUCCO DELLA SERIALE VIRTUALE
// ===================================================================================
// Architecture for backward compatibility. By redefining the `Serial` macro
// to point to our dereferenced stream (*Serial_OpenFIRE_Stream), the entire
// legacy codebase (originally designed for wired USB) can use `Serial.print`
// and `Serial.write` as usual. Data will be routed via cable or network
// (ESP-NOW) depending on the outcome of the prior negotiation.
// /
// Architettura per retrocompatibilità. Ridefinendo la macro `Serial` per 
// puntare al nostro stream dereferenziato (*Serial_OpenFIRE_Stream), l'intera codebase 
// legacy (nata per USB wired) può usare `Serial.print` e `Serial.write` come sempre. 
// I dati verranno instradati via Cavo o via Rete (ESP-NOW) a seconda 
// dell'esito della negoziazione precedente.

    // ===================================================================================
    // === [ESP32_PORT] ===
    // ===================================================================================
    
    #ifdef OPENFIRE_WIRELESS_ENABLE
        #ifdef Serial
            #undef Serial
        #endif
        #define Serial (*Serial_OpenFIRE_Stream)
    #endif // OPENFIRE_WIRELESS_ENABLE
    
    // ===================================================================================
    // === [ESP32_PORT] ===
    // ===================================================================================


    // AbsMouse5.init(true); // [ESP32_PORT] removed for the new OpenFire_TinyDevice / rimosso per il mio nuovo OpenFire_TinyDevice

    // IR camera maxes out motion detection at ~300Hz, and millis() isn't good enough

    // Wireless operation introduces overhead. Reducing the IR camera tick rate
    // when on battery (from 5ms to ~15ms) frees up CPU for ESP-NOW, limiting potential system lag; however,
    // I found it works well even at the same frequency used for the wired connection,
    // so I set it to the same value—209Hz, corresponding to approximately 5ms.
    // /
    // L'esecuzione wireless introduce overhead. Ridurre il tick rate della telecamera IR 
    // su batteria (da 5ms a ~15ms) offre più CPU all'ESP-NOW limitando possibili lag di sistema, ma
    // ho riscontrato che funziona comunque bene alla stessa frequenza usata con connessione via cavo,
    // quindi l'ho impostata uguale ovvero 209Hz che corrisponde a circa 5ms
    if (TinyUSBDevices.onBattery) startIrCamTimer(CamFPS/*209*/);  // set to 5ms for wireless too... e.g., 100->10ms, 66->15ms for wireless connection / impostato a 5ms anche per wireless ... es. 100->10ms 66 -> 15ms per connessione wireless
      else startIrCamTimer(CamFPS/*209*/); // 5ms for wired connection / 5ms per connessione via cavo
    
    FW_Common::OpenFIREper.source(OF_Prefs::profiles[OF_Prefs::currentProfile].adjX,
                                  OF_Prefs::profiles[OF_Prefs::currentProfile].adjY);
    FW_Common::OpenFIREper.deinit(0);

    // First boot sanity checks; all zeroes are initial config
    if((OF_Prefs::profiles[OF_Prefs::currentProfile].topOffset    == 0 &&
        OF_Prefs::profiles[OF_Prefs::currentProfile].bottomOffset == 0 && 
        OF_Prefs::profiles[OF_Prefs::currentProfile].leftOffset   == 0 &&
        OF_Prefs::profiles[OF_Prefs::currentProfile].rightOffset  == 0)) {

        // This is a first boot! Prompt to start calibration.
        unsigned int timerIntervalShort = 600;
        unsigned int timerInterval = 1000;
        OF_RGB::LedOff();
        unsigned long lastT = millis();
        bool LEDisOn = false;

        #ifdef USES_DISPLAY
            FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_Init);
        #endif // USES_DISPLAY

        while(!(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Trigger) || FW_Common::camNotAvailable) {
            // Check and process serial commands, in case user needs to change EEPROM settings.
            if(Serial.available())
                OF_Serial::SerialProcessingDocked();
            
            if(FW_Common::gunMode == FW_Const::GunMode_Docked) {
                ExecGunModeDocked();

                // Because the app offers cali options, exit straight to normal runmode
                // if we exited from docking with a setup profile.
                if(!(OF_Prefs::profiles[OF_Prefs::currentProfile].topOffset == 0 &&
                     OF_Prefs::profiles[OF_Prefs::currentProfile].bottomOffset == 0 && 
                     OF_Prefs::profiles[OF_Prefs::currentProfile].leftOffset == 0 &&
                     OF_Prefs::profiles[OF_Prefs::currentProfile].rightOffset == 0)) {
                      FW_Common::SetMode(FW_Const::GunMode_Run);
                      break;
                #ifdef USES_DISPLAY
                } else { FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_Init);
                #endif // USES_DISPLAY
                }
            }

            FW_Common::buttons.Poll(1);
            FW_Common::buttons.Repeat();

            // LED update:
            if(LEDisOn) {
                unsigned long t = millis();
                if(t - lastT > timerInterval) {
                    OF_RGB::LedOff();
                    LEDisOn = false;
                    lastT = millis();
                }
            } else {
                unsigned long t = millis();
                if(t - lastT > timerIntervalShort) {
                    OF_RGB::LedUpdate(255,125,0);
                    LEDisOn = true;
                    lastT = millis();
                } 
            }
        }

        // skip cali if we're prematurely set to run from the above loop
        // (i.e. cal'd from Desktop)
        if(FW_Common::gunMode != FW_Const::GunMode_Run)
            FW_Common::SetMode(FW_Const::GunMode_Calibration);
    } else {
        // this will turn off the DotStar/RGB LED and ensure proper transition to Run
        FW_Common::SetMode(FW_Const::GunMode_Run);
    }
}

#ifdef ARDUINO_ARCH_ESP32
void startIrCamTimer(const int &frequencyHz)
{  
    My_timer = timerBegin(1000000);      
    timerAttachInterrupt(My_timer, &esp32s3pwmIrq);
    timerAlarm(My_timer, (uint64_t) 1000000 / frequencyHz, true, 0);
}

void ARDUINO_ISR_ATTR esp32s3pwmIrq(void)
{
    FW_Common::irPosUpdateTick = 1;
}
#endif


#ifdef ARDUINO_ARCH_RP2040
void startIrCamTimer(const int &frequencyHz)
{
    rp2040EnablePWMTimer(0, frequencyHz);
    irq_set_exclusive_handler(PWM_IRQ_WRAP, rp2040pwmIrq);
    irq_set_enabled(PWM_IRQ_WRAP, true);
}

void rp2040EnablePWMTimer(const unsigned int &slice_num, const unsigned int &frequency)
{
    pwm_config pwmcfg = pwm_get_default_config();
    float clkdiv = (float)clock_get_hz(clk_sys) / (float)(65535 * frequency);
    if(clkdiv < 1.0f) {
        clkdiv = 1.0f;
    } else {
        // really just need to round up 1 lsb
        clkdiv += 2.0f / (float)(1u << PWM_CH1_DIV_INT_LSB);
    }
    
    // set the clock divider in the config and fetch the actual value that is used
    pwm_config_set_clkdiv(&pwmcfg, clkdiv);
    clkdiv = (float)pwmcfg.div / (float)(1u << PWM_CH1_DIV_INT_LSB);
    
    // calculate wrap value that will trigger the IRQ for the target frequency
    pwm_config_set_wrap(&pwmcfg, (float)clock_get_hz(clk_sys) / (frequency * clkdiv));
    
    // initialize and start the slice and enable IRQ
    pwm_init(slice_num, &pwmcfg, true);
    pwm_set_irq_enabled(slice_num, true);
}

void rp2040pwmIrq(void)
{
    pwm_hw->intr = 0xff;
    FW_Common::irPosUpdateTick = 1;
}
#endif // ARDUINO_ARCH_RP2040 // [ESP32_PORT] messo qui

